admbase/src/Documents/РасходПродуктов/РасходПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходПродуктов</name>
  <registerRecords>AccumulationRegister.ОстаткиПродуктовНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ИзготовлениеБлюд</registerRecords>
  <attributes>
    <name>ВидСтола</name>
    <type>
      <types>EnumRef.ВидыСтолов</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияМеню</name>
    <type>
      <types>CatalogRef.КатегорииМеню</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставСтола</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Продукты</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/AccumulationRegisters/ОстаткиПродуктовНаСкладах/ОстаткиПродуктовНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПродуктовНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

admbase/src/AccumulationRegisters/ИзготовлениеБлюд/ИзготовлениеБлюд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИзготовлениеБлюд</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСтола</name>
    <type>
      <types>EnumRef.ВидыСтолов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияМеню</name>
    <type>
      <types>CatalogRef.КатегорииМеню</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

admbase/src/Catalogs/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНоменклатуры</name>
  <predefined>
    <items>
      <name>Блюда</name>
      <description>Блюда</description>
    </items>
    <items>
      <name>Меню</name>
      <description>Меню</description>
    </items>
    <items>
      <name>Продукты</name>
      <description>Продукты</description>
    </items>
  </predefined>
</mdclass:Catalog>

admbase/src/Documents/РасходПродуктов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
#Область ТекстЗапроса
Запрос.Текст = "ВЫБРАТЬ
|	РасходПродуктовПродукты.Номенклатура КАК Номенклатура,
|	РасходПродуктовПродукты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
|	РасходПродуктовПродукты.Количество КАК Количество,
|	РасходПродуктовПродукты.Вес КАК Вес,
|	РасходПродуктов.Дата КАК Период,
|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
|	РасходПродуктов.МестоХранения КАК МестоХранения
|ИЗ
|	Документ.РасходПродуктов.Продукты КАК РасходПродуктовПродукты
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходПродуктов КАК РасходПродуктов
|		ПО РасходПродуктовПродукты.Ссылка = РасходПродуктов.Ссылка
|ГДЕ
|	РасходПродуктовПродукты.Ссылка = &Ссылка
|
|УПОРЯДОЧИТЬ ПО
|	РасходПродуктовПродукты.НомерСтроки
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	РасходПродуктовСоставСтола.Номенклатура КАК Номенклатура,
|	РасходПродуктовСоставСтола.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
|	РасходПродуктовСоставСтола.Количество КАК Количество,
|	РасходПродуктов.Дата КАК Период,
|	РасходПродуктов.ВидСтола КАК ВидСтола,
|	РасходПродуктов.КатегорияМеню КАК КатегорияМеню
|ИЗ
|	Документ.РасходПродуктов.СоставСтола КАК РасходПродуктовСоставСтола
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходПродуктов КАК РасходПродуктов
|		ПО РасходПродуктовСоставСтола.Ссылка = РасходПродуктов.Ссылка
|ГДЕ
|	РасходПродуктовСоставСтола.Ссылка = &Ссылка
|	И РасходПродуктовСоставСтола.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Блюда)
|
|УПОРЯДОЧИТЬ ПО
|	РасходПродуктовСоставСтола.НомерСтроки
|";
	
#КонецОбласти

	Результат = Запрос.ВыполнитьПакет();
	
	Движения.ОстаткиПродуктовНаСкладах.Записывать = Истина;
	
	Выборка = Результат[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ОстаткиПродуктовНаСкладах.Добавить(),Выборка)
	КонецЦикла;

	
	Движения.ИзготовлениеБлюд.Записывать = Истина;
	
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ИзготовлениеБлюд.Добавить(),Выборка)
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ИзКалендаря") Тогда
		 ЗаполнитьИзКалендаря(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИзКалендаря(СтруктураКалендаря)

	//шапка
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,СтруктураКалендаря);
	
	Документы.РасходПродуктов.ЗаполнениеПриИзмененииМеню(ЭтотОбъект,Номенклатура,"КатегорияМеню");
	Ответственный = Пользователи.ТекущийПользователь();
	
	//тч составстола
	Документы.РасходПродуктов.ЗаполнениеТабличнойЧастиСоставСтола(ЭтотОбъект);

	//тч продукты
	Документы.РасходПродуктов.ЗаполнениеТабличнойчастиПродукты(ЭтотОбъект);

КонецПроцедуры



#КонецОбласти 

//СДЕЛАТЬ КОНТРОЛЬ ПРОВЕДЕНИЯ И ОТМЕНЫ ПРОВЕДЕНИЯ
#КонецЕсли
